FRIEDparrot/ClassReview/💻softwares/⚡Circuit/🎮STM32教程/模板文件/HardWare/SPI_SD/stm32_spi_sd.c
  if (Cmd == SD_CMD_STOP_TRANSMISSION) SD_WriteByte(0xFF);
}

/** @brief  Get SD card data response.
  * @param  None
  * @retval The SD status: Read data response xxx0<status>1
  *         - status 010: Data accecpted
  *         - status 101: Data rejected due to a crc error
  *         - status 110: Data rejected due to a Write error.
  *         - status 111: Data rejected due to other error.
  */
uint8_t SD_GetDataResponse(void)
{
  uint32_t i = 0;
  uint8_t response, rvalue;

  while (i <= 64)
  {
    /*!< Read resonse */
    response = SD_ReadByte();
    /*!< Mask unused bits */
    response &= 0x1F;
    switch (response)
    {
      case SD_DATA_OK:
      {
        rvalue = SD_DATA_OK;
        break;
      }
      case SD_DATA_CRC_ERROR:
        return SD_DATA_CRC_ERROR;
      case SD_DATA_WRITE_ERROR:
        return SD_DATA_WRITE_ERROR;
      default:
      {
        rvalue = SD_DATA_OTHER_ERROR;
        break;
      }
    }
    /*!< Exit loop in case of data ok */
    if (rvalue == SD_DATA_OK)
      break;
    /*!< Increment loop counter */
    i++;
  }

  /*!< Wait null data */
  while (SD_ReadByte() == 0);

  /*!< Return response */
  return response;
}

/**
  * @brief  Returns the SD response.
  * @param  None
  * @retval The SD Response: 
  *         - SD_RESPONSE_FAILURE: Sequence failed
  *         - SD_RESPONSE_NO_ERROR: Sequence succeed
  */
SD_Error SD_GetResponse(uint8_t Response)
{
  uint32_t Count = 0xFFF;
  /*!< Check if response is got or a timeout is happen */
  while ((SD_ReadByte() != Response) && Count)
  {
    Count--;
  }
  if (Count == 0)
  {
    /*!< After time out */
    return SD_RESPONSE_FAILURE;
  }
  else
  {
    /*!< Right response got */
    return SD_RESPONSE_NO_ERROR;
  }
}

/**
  * @brief  Returns the SD status.
  * @param  None
  * @retval The SD status.
  */
uint16_t SD_GetStatus(void)
{
  uint16_t Status = 0;
  /*!< SD chip select low */
  SD_CS_LOW();

  /*!< Send CMD13 (SD_SEND_STATUS) to get SD status */
  SD_SendCmd(SD_CMD_SEND_STATUS, 0, 0xFF);

  Status = SD_ReadByte();
  Status |= (uint16_t)(SD_ReadByte() << 8);

  /*!< SD chip select high */
  SD_CS_HIGH();

  /*!< Send dummy byte 0xFF */
  SD_WriteByte(SD_DUMMY_BYTE);
  return Status;
}

/**
  * @brief  Put SD in Idle state.
  * @param  None
  * @retval The SD Response: 
  *         - SD_RESPONSE_FAILURE: Sequence failed
  *         - SD_RESPONSE_NO_ERROR: Sequence succeed
  */
SD_Error SD_GoIdleState(void)
{
  /*!< SD chip select low */
  SD_CS_LOW();
  
  /*!< Send CMD0 (SD_CMD_GO_IDLE_STATE) to put SD in SPI mode */
  SD_SendCmd(SD_CMD_GO_IDLE_STATE, 0, 0x95);
  
  /*!< Wait for In Idle State Response (R1 Format) equal to 0x01 */
  if (SD_GetResponse(SD_IN_IDLE_STATE))
  {
    SD_CS_HIGH();
    /*!< No Idle State Response: return response failue */
    return SD_RESPONSE_FAILURE;
  }

  /*---------- Activates the card initialization process -----------*/
  /// @note : this initialization process is for MMC card, so fix it to SD card
  SD_CS_LOW();
  SD_SendCmd(SD_CMD_SEND_IF_COND,  0x000001CD, 0x55);  // CMD8 -> must have CRC 
  /* for SD card, it will get a 0x01 Response*/
  if (!SD_GetResponse(0x01)){
    uint8_t *buf = new uint8_t(4);
    SD_ReadBytes(buf, 4);
    if(buf[2]==0X01&&buf[3]==0XCD) // SD 2.0 card detected 
    {
      uint16_t r2 = 0x01;           // support 2.7V to 3.6V
      /* wait for SD2.0 initialize successful */
      uint16_t retry;
      for (retry = 0x00FF; (r2 && retry); retry--){
        SD_SendCmd(SD_CMD_APP_CMD, 0x00, 0x01);
        SD_GetResponse(0x01);
        SD_SendCmd(SD_ACMD_SD_SEND_OP_COND, 0x40000000, 0x01);  // support High Capacity Card
        r2 = SD_WaitResponse();  /*exit when r2 = 0x00*/
      }
      
      /**** read OCR Register for test the SD2.0 Version ******/
      uint8_t r3;
      SD_SendCmd(SD_CMD_READ_OCR, 0x00,0x01);
      r3 = SD_WaitResponse();

      /* wait for 0x00 response */
      if (r3 == 0x00){
        uint8_t *buf2 = new uint8_t(4);  // receive OCR reg data 
        SD_ReadBytes(buf2, 4);
        if (buf2[0] & 0x40){
          SD_CARD_TYPE = SD_TYPE_V2HC;  // OLED_ShowString(3,1,"SD_HC Card");
        }else{
          SD_CARD_TYPE = SD_TYPE_V2;    // OLED_ShowString(3,1,"SD Card");
        }
        return SD_RESPONSE_NO_ERROR;
      }
    }
  }else{ // not support CMD8
    SD_SendCmd(SD_CMD_APP_CMD, 0x00, 0x01);
    SD_WaitResponse();
    SD_SendCmd(SD_ACMD_SD_SEND_OP_COND, 0x00, 0x01);
    uint8_t r4 = SD_WaitResponse();
    if (r4 <= 1){ // SD 1.0 Card
      uint8_t r5 = 0x01; uint16_t retry;
      for (retry = 0x0FFF; (r5 && retry); retry--){
        SD_SendCmd(SD_CMD_APP_CMD, 0x00, 0x01);
        SD_GetResponse(0x01);
        SD_SendCmd(SD_ACMD_SD_SEND_OP_COND, 0x40000000, 0x01);  // support High Capacity Card 
        r5 = SD_WaitResponse();  /*exit when r2 = 0x00*/
      }
      if (retry == 0) return SD_RESPONSE_FAILURE;
      else{
        SD_SendCmd(SD_CMD_SET_BLOCKLEN, 512, 0x01);
        if (SD_WaitResponse()==0x00){
          SD_CARD_TYPE = SD_TYPE_V1;
          return SD_RESPONSE_NO_ERROR;
        }
      }
    }// else  May be MMC card -> not support
  }
  SD_CS_HIGH();
  /*!< Send dummy byte 0xFF */
  SD_WriteByte(SD_DUMMY_BYTE);    // end init 
  return SD_RESPONSE_FAILURE;
}

/**
  * @brief  Write a byte on the SD.
  * @param  Data: byte to send.
  * @retval None
  * @bug    may caused infinite loop if SPI not init
  */
uint8_t SD_WriteByte(uint8_t Data)
{
  /*!< Wait until the transmit buffer is empty */
  while(SPI_I2S_GetFlagStatus(SD_SPI, SPI_I2S_FLAG_TXE) == RESET);
  /*!< Send the byte */
  SPI_I2S_SendData(SD_SPI, Data);
  /*!< Wait to receive a byte*/
  while(SPI_I2S_GetFlagStatus(SD_SPI, SPI_I2S_FLAG_RXNE) == RESET);
  /*!< Return the byte read from the SPI bus */ 
  return SPI_I2S_ReceiveData(SD_SPI);
}

/**
  * @brief  Read a byte from the SD.
  * @param  None
  * @retval The received byte.
  */
uint8_t SD_ReadByte(void)
{
  uint8_t Data = 0;
  /*!< Wait until the transmit buffer is empty */
  while (SPI_I2S_GetFlagStatus(SD_SPI, SPI_I2S_FLAG_TXE) == RESET);
  /*!< Send the byte */
  SPI_I2S_SendData(SD_SPI, SD_DUMMY_BYTE);
  /*!< Wait until a data is received */
  while (SPI_I2S_GetFlagStatus(SD_SPI, SPI_I2S_FLAG_RXNE) == RESET);
  /*!< Get the received data */
  Data = SPI_I2S_ReceiveData(SD_SPI);
  /*!< Return the shifted data */
  return Data;
}

/****************** Function Added  **********************/

/// @brief Read several bytes from SD card, use data buff (at least of size length)
/// @note use 0xFF for exchange bytes 
/// @param data_buff 
/// @param length
void SD_ReadBytes(uint8_t* &data_buff, uint32_t length){
    SD_CS_LOW();
    for (uint8_t i = 0; i< length; i++) data_buff[i] = SD_ReadByte();
}

/// @brief wait until the highest bit is 0 
/// @note  10 is maximum retry time 
/// @return 
uint8_t SD_WaitResponse(void){
  uint8_t response = 0xFF;
  // wait until the highest bit is 0 
  for (uint16_t temp = 0x10; ((response & 0x80) && temp > 0);temp--){
    response = SD_ReadByte();
  }
  return response;
}

/**
  * @brief  DeInitializes the SD/SD communication.
  * @param  None
  * @retval None
  */
void SD_LowLevel_DeInit(void)
{
  GPIO_InitTypeDef  GPIO_InitStructure;
  
